# Parameter Type Id Rbs Elec Circuit State Property

Source: https://www.revitapidocs.com/2026/ff0f0cbc-c1f2-d7b5-e3cc-2aef2b9a1c7d.htm

---

| Parameter Type Id Rbs Elec Circuit State Property |
| --- |

"Circuit State"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitState { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitState As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitState {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitState : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace